#### Combining and Merging  Datasets

##### Join, Combine and Reshape

In [2]:
import pandas as pd
import numpy as np

In [2]:
df1=pd.DataFrame({'Student':['John','John','Adam','Smith','Adam','Adam','John'],'Absentism':[10,4,5,7,3,2,6]})
df2=pd.DataFrame({'Student':['Adam','Bruce','John'],'Absentism':[0,1,2]})

In [3]:
df1

  Student  Absentism
0    John         10
1    John          4
2    Adam          5
3   Smith          7
4    Adam          3
5    Adam          2
6    John          6

In [4]:
df2

  Student  Absentism
0    Adam          0
1   Bruce          1
2    John          2

In [16]:
pd.merge(df1,df2,on='Student')# it is better to specify which column to join on, here :>  on ='Student'
# Note that merge by default take the common set (intersection) found in both table thus 'Bruce' is there in merged table.

  Student  Absentism_x  Absentism_y
0    John           10            2
1    John            4            2
2    John            6            2
3    Adam            5            0
4    Adam            3            0
5    Adam            2            0

In [20]:
pd.merge(df1,df2,on='Student',how='outer') # for union of both the table, key:>  how ='outer' is used'

  Student  Absentism_x  Absentism_y
0    John         10.0          2.0
1    John          4.0          2.0
2    John          6.0          2.0
3    Adam          5.0          0.0
4    Adam          3.0          0.0
5    Adam          2.0          0.0
6   Smith          7.0          NaN
7   Bruce          NaN          1.0

In [21]:
pd.merge(df1,df2,on='Absentism',how='inner')

  Student_x  Absentism Student_y
0      Adam          2      John

In [27]:
df3=pd.DataFrame({'Lstudent':['J','J','A','S','A','A','J'],'Absentism_L':[10,4,5,7,3,2,6]})
df4=pd.DataFrame({'Rstudent':['Ap','B','Ja'],'Absentism_R':[0,1,2]})

In [46]:
df3

  Lstudent  Absentism_L
0     John           10
1     John            4
2     Adam            5
3    Smith            7
4     Adam            3
5     Adam            2
6     John            6

In [47]:
df4

  Rstudent  Absentism_R
0   Apollo            0
1    Bryan            1
2    Jason            2

In [30]:
pd.merge(df3,df4,left_on='Lstudent',right_on='Rstudent',how='outer')

  Lstudent  Absentism_L Rstudent  Absentism_R
0     John         10.0      NaN          NaN
1     John          4.0      NaN          NaN
2     John          6.0      NaN          NaN
3     Adam          5.0      NaN          NaN
4     Adam          3.0      NaN          NaN
5     Adam          2.0      NaN          NaN
6    Smith          7.0      NaN          NaN
7      NaN          NaN   Apollo          0.0
8      NaN          NaN    Bryan          1.0
9      NaN          NaN    Jason          2.0

In [31]:
df5=pd.DataFrame({'student':['John','John','Adam','Smith','Adam','Adam','John'],'Absentism':[10,4,5,7,3,2,6]})
df6=pd.DataFrame({'student':['Apollo','Bryan','Jason'],'Absentism':[0,1,2]})

In [48]:
df5

  student  Absentism
0    John         10
1    John          4
2    Adam          5
3   Smith          7
4    Adam          3
5    Adam          2
6    John          6

In [49]:
df6

  student  Absentism
0  Apollo          0
1   Bryan          1
2   Jason          2

In [37]:
pd.merge(df5,df6,on='Absentism',how='outer')

  student_x  Absentism student_y
0      John         10       NaN
1      John          4       NaN
2      Adam          5       NaN
3     Smith          7       NaN
4      Adam          3       NaN
5      Adam          2     Jason
6      John          6       NaN
7       NaN          0    Apollo
8       NaN          1     Bryan

In [52]:
pd.merge(df5,df6,on='student',how='outer')

  student  Absentism_x  Absentism_y
0    John         10.0          NaN
1    John          4.0          NaN
2    John          6.0          NaN
3    Adam          5.0          NaN
4    Adam          3.0          NaN
5    Adam          2.0          NaN
6   Smith          7.0          NaN
7  Apollo          NaN          0.0
8   Bryan          NaN          1.0
9   Jason          NaN          2.0

In [ ]:
#### Merging in index: In some cases, the merge keys in a DataFrame will be found in its index.
### in this case , you can pass : left_index=True  OR right_index=True or both .

In [23]:
df_l=pd.DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})
df_r=pd.DataFrame({'grou_val':[3.5,7]},index=['a','b'])

In [24]:
df_l

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [25]:
df_r

   grou_val
a       3.5
b       7.0

In [26]:
pd.merge(df_l,df_r,left_on='key',right_index=True) # BY default it is intersection

  key  value  grou_val
0   a      0       3.5
2   a      2       3.5
3   a      3       3.5
1   b      1       7.0
4   b      4       7.0

In [27]:
pd.merge(df_l,df_r,left_on='key',right_index=True, how='outer') # for union:> how= 'outer'

  key  value  grou_val
0   a      0       3.5
2   a      2       3.5
3   a      3       3.5
1   b      1       7.0
4   b      4       7.0
5   c      5       NaN

#### Hierarchial Indexing

In Series

In [4]:
np.random.randn(9)

array([ 0.18659206,  1.53887051, -0.59185353, -0.62172803, -0.60289378,
        0.21659016, -2.07548549,  0.8086604 , -0.3761129 ])

In [3]:
data_h=pd.Series(np.random.randn(9)*5,index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])
data_h

a  1    7.414619
   2   -2.047706
   3    6.817679
b  1    4.606090
   3   -6.507156
c  1    2.605361
   2   -3.938383
d  2    0.957688
   3   -0.782421
dtype: float64

In [5]:
data_h.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

With hierarchial indexing, subsets of data can be selected concisely:

In [12]:
data_h.loc[['d','a']]

a  1    7.381642
   2   -4.351045
   3   -5.274106
d  2   -9.145477
   3   -5.072983
dtype: float64

In [15]:
data_h.loc[:,2]

a   -4.351045
c    2.552362
d   -9.145477
dtype: float64

In [9]:
data_h['b']

1   -0.351158
3    0.531431
dtype: float64

In [10]:
data_h['b':'c']

b  1   -0.351158
   3    0.531431
c  1   -3.256673
   2    2.552362
dtype: float64

In [16]:
data_h.unstack() # Hierarchial data can be converted into dataframe by using :> unstack

          1         2         3
a  7.381642 -4.351045 -5.274106
b -0.351158       NaN  0.531431
c -3.256673  2.552362       NaN
d       NaN -9.145477 -5.072983

In [17]:
data_h.unstack().stack()

a  1    7.381642
   2   -4.351045
   3   -5.274106
b  1   -0.351158
   3    0.531431
c  1   -3.256673
   2    2.552362
d  2   -9.145477
   3   -5.072983
dtype: float64

In DataFrame: With DataFrame either axis can have a hierarchical index

In [6]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['ohio','ohio','colorado'],['Green','Red','Green']])
frame

     ohio     colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [7]:
frame.index.names=['key1','key2']
frame.columns.names=['state','color']
frame

state      ohio     colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [21]:
frame['ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [22]:
frame['colorado']

color      Green
key1 key2
a    1         2
     2         5
b    1         8
     2        11

In [23]:
frame

state      ohio     colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [26]:
frame.swaplevel('key1','key2') # swaplevel takes two numbers or name and returns a new object with level interchanged

state      ohio     colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [27]:
frame.sort_index(level=0)

state      ohio     colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [28]:
frame.sort_index(level=1)

state      ohio     colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [29]:
frame.swaplevel(0,1).sort_index(level=0)

state      ohio     colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

Summery Statistics by level

In [31]:
frame.sum(level='key1')

state  ohio     colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [33]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [34]:
frame.sum(level='state',axis=1)

state      ohio  colorado
key1 key2
a    1        1         2
     2        7         5
b    1       13         8
     2       19        11

Indexing with a DataFrame's columns:
We can use one or more columns as  row index OR we may wish to move the row index into the DataFrame's columns.

In [35]:
frame1=pd.DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})
frame1

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [41]:
frame2=frame1.set_index(['c','d']) ## by default the columns are dropped, we can keep it:> drop=False
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [42]:
frame2.reset_index() ## opposite of > .set_index():>  .reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [39]:
frame2=frame1.set_index(['c','d'],drop=False)
frame2

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

## Concatenating along an axis
   #### Series

##### Note: concatenating arguments: axis , join, join_axes, keys,levels, names, ignore_index

In [2]:
import pandas as pd
import numpy as np

In [8]:
s1=pd.Series([0,1],index=['a','b'])
s2=pd.Series([2,3,4],index=['c','d','e'])
s3=pd.Series([5,6],index=['f','g'])

In [9]:
s1

a    0
b    1
dtype: int64

In [10]:
s2

c    2
d    3
e    4
dtype: int64

In [11]:
s3

f    5
g    6
dtype: int64

In [12]:
pd.concat([s1,s2,s3],axis=1)# by default concat acts along axis=0, axis=1 can be passed

D:\Instal_Anaonda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [53]:
pd.concat([s1,s2,s3],axis=1,sort=True)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [15]:
s11=pd.Series([0,1],index=['a','b'])
s22=pd.Series([2,3,4],index=['a','b','c'])
s33=pd.Series([5,6],index=['a','b'])

In [16]:
pd.concat([s11,s22,s33],axis=1,sort=True)

     0  1    2
a  0.0  2  5.0
b  1.0  3  6.0
c  NaN  4  NaN

In [54]:
s4=pd.concat([s1,s3])
s4

a    0
b    1
f    5
g    6
dtype: int64

In [55]:
s1

a    0
b    1
dtype: int64

In [57]:
pd.concat([s1,s4],axis=1,sort=True) ## by default it is intersection, for uion pass :> join='inner'

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [59]:
pd.concat([s1,s4],axis=1,join='inner',sort=True) ## intersection thus: f,g disappeared

   0  1
a  0  0
b  1  1

In [62]:
# We can even specify the axes to be used on the other axes with :> join_axes=[[...]]
pd.concat([s1,s4],axis=1,join_axes=[['a','c','b','e']],sort=True )

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

In [67]:
# To identify the concatenated pieces, use keys argument as below:
result=pd.concat([s1,s2,s3],keys=['one','two','three'])
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [70]:
result.unstack()

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [72]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'],sort=True)

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

#### DataFrame: 
###### Same logic is extended in DataFrame as .

In [3]:
df1=pd.DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['one','two'])
df2=pd.DataFrame(np.arange(4).reshape(2,2),index=['a','b'],columns=['three','four'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [4]:
df2

   three  four
a      0     1
b      2     3

In [5]:
pd.concat([df1,df2],keys=['level1','level2'],sort=False)##By default axis=0 is taken

          one  two  three  four
level1 a  0.0  1.0    NaN   NaN
       b  2.0  3.0    NaN   NaN
       c  4.0  5.0    NaN   NaN
level2 a  NaN  NaN    0.0   1.0
       b  NaN  NaN    2.0   3.0

In [6]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],sort=True)

  level1     level2
     one two  three four
a      0   1    0.0  1.0
b      2   3    2.0  3.0
c      4   5    NaN  NaN

In [81]:
# above same thing can be done like this as well:
pd.concat({'level1':df1,'level2':df2},axis=1,sort=True)

  level1     level2
     one two  three four
a      0   1    0.0  1.0
b      2   3    NaN  NaN
c      4   5    2.0  3.0

In [87]:
# Hierarchial indexing is also possible with concatanting: with 'names' argument
pd.concat([df1,df2],keys=['level1','level2'],names=['upper','lower'],axis=1,sort=False)

upper level1     level2
lower    one two  three four
a          0   1    0.0  1.0
b          2   3    NaN  NaN
c          4   5    2.0  3.0

In [89]:
# when there is no relevant information in index then we can drop it by :>  ignore_index=True
# and a new index is created:
dff1=pd.DataFrame(np.random.randn(3,4),columns=['a','b','c','d'])
dff2=pd.DataFrame(np.random.randn(2,3),columns=['b','d','a'])
dff1

          a         b         c         d
0 -0.055324 -1.016547 -0.383711  1.518202
1 -0.105237  0.792556  1.094314  1.725244
2 -1.375950 -1.304570  0.479815  0.387628

In [90]:
dff2

          b         d         a
0 -0.742229  2.151678 -0.067318
1  1.217697  0.215122 -1.277465

In [93]:
pd.concat([dff1,dff2],sort=True)

          a         b         c         d
0 -0.055324 -1.016547 -0.383711  1.518202
1 -0.105237  0.792556  1.094314  1.725244
2 -1.375950 -1.304570  0.479815  0.387628
0 -0.067318 -0.742229       NaN  2.151678
1 -1.277465  1.217697       NaN  0.215122

In [94]:
pd.concat([df1,df2],ignore_index=True,sort=True)

   four  one  three  two
0   NaN  0.0    NaN  1.0
1   NaN  2.0    NaN  3.0
2   NaN  4.0    NaN  5.0
3   1.0  NaN    0.0  NaN
4   3.0  NaN    2.0  NaN

### Combining data with overlap
 We may have two dataset whose indexes overlap in full or part:

In [95]:
a=pd.Series([np.nan,3,np.nan,3.5,4.5,np.nan],index=['f','e','d','c','b','a'])
a

f    NaN
e    3.0
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [96]:
b=pd.Series(np.arange(len(a),dtype=np.float64),index=['f','e','d','c','b','a'])
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [97]:
np.where(pd.isnull(a),b,a)

array([0. , 3. , 2. , 3.5, 4.5, 5. ])

Above operation can be done using method :> combine_first

In [98]:
a.combine_first(b)

f    0.0
e    3.0
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

With DataFrame same operation is done column by column,it can be think like patching missing data in the calling object
with data from the object that is  passed.

### Reshaping and pivoting
   ######  . stack ( ) : This rotates or pivots from the columns in the data to the rows  
   ###### . unstack ( ) : This pivots from the rows into the columns

In [102]:
data1=pd.DataFrame(np.arange(6).reshape((2,3)),index=pd.Index(['ohio','colorado',],name='state'),columns=pd.Index(['one','two','three'],name='number'))
data1

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [113]:
data1.stack()

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [109]:
result=data1.stack('number')
result ## here result became hierarchial indexing type

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [114]:
result.unstack() ## by defautl innermost level is unstacked( Here: state is outer and number is inner)

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [110]:
result.unstack('number')

number    one  two  three
state
ohio        0    1      2
colorado    3    4      5

In [111]:
result.unstack('state')

state   ohio  colorado
number
one        0         3
two        1         4
three      2         5

In [115]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

Note: unstacking might introduce missing data if all of the values in the level aren't found in each of the subgroup

In [16]:
import pandas as pd
import numpy as np
s1=pd.Series([0,1,2,3],index=['a','b','c','d'])
s2=pd.Series([4,5,6],index=['c','d','e'])
data2=pd.concat([s1,s2],keys=['one','two'],axis=0,sort=True)
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [17]:
result1=data2.unstack()
result1

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [18]:
## stack automatically removes NaN, To keep NaN, pass :> dropna=False
result1.stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [135]:
result

state     number
ohio      one       0
          two       1
          three     2
colorado  one       3
          two       4
          three     5
dtype: int32

In [138]:
dff=pd.DataFrame({'left':result,'right':result+5},columns=pd.Index(['left','right'],name='side'))
dff

side             left  right
state    number
ohio     one        0      5
         two        1      6
         three      2      7
colorado one        3      8
         two        4      9
         three      5     10

In [142]:
dff.unstack('state')

side   left          right
state  ohio colorado  ohio colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [143]:
dff.unstack('state').stack('side')

state         colorado  ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

# . pivot ( )   : long to wide table

In [5]:
dt=pd.read_csv('macrodata.csv')
dt.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [6]:
periods=pd.PeriodIndex(year=dt.year,quarter=dt.quarter,name='date')
columns=pd.Index(['realgdp','infl','unemp'],name='item')
dt=dt.reindex(columns=columns)
dt.index=periods.to_timestamp('D','end')
ldata=dt.stack().reset_index().rename(columns={0:'value'})
ldata.head() ### long format of table

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340

In [7]:
ldata['value2']=np.random.randn(len(ldata))
ldata[:10]

        date     item     value    value2
0 1959-03-31  realgdp  2710.349  0.776863
1 1959-03-31     infl     0.000 -0.151040
2 1959-03-31    unemp     5.800 -0.654748
3 1959-06-30  realgdp  2778.801  0.519392
4 1959-06-30     infl     2.340  0.080712
5 1959-06-30    unemp     5.100 -0.955207
6 1959-09-30  realgdp  2775.488 -0.682092
7 1959-09-30     infl     2.740  0.136987
8 1959-09-30    unemp     5.300  0.573443
9 1959-12-31  realgdp  2785.204 -0.416602

In [8]:
pivoted=ldata.pivot('date','item','value')
pivoted # wide format of table

item        infl    realgdp  unemp
date
1959-03-31  0.00   2710.349    5.8
1959-06-30  2.34   2778.801    5.1
1959-09-30  2.74   2775.488    5.3
1959-12-31  0.27   2785.204    5.6
1960-03-31  2.31   2847.699    5.2
1960-06-30  0.14   2834.390    5.2
1960-09-30  2.70   2839.022    5.6
1960-12-31  1.21   2802.616    6.3
1961-03-31 -0.40   2819.264    6.8
1961-06-30  1.47   2872.005    7.0
1961-09-30  0.80   2918.419    6.8
1961-12-31  0.80   2977.830    6.2
1962-03-31  2.26   3031.241    5.6
1962-06-30  0.13   3064.709    5.5
1962-09-30  2.11   3093.047    5.6
1962-12-31  0.79   3100.563    5.5
1963-03-31  0.53   3141.087    5.8
1963-06-30  2.75   3180.447    5.7
1963-09-30  0.78   3240.332    5.5
1963-12-31  2.46   3264.967    5.6
1964-03-31  0.13   3338.246    5.5
1964-06-30  0.90   3376.587    5.2
1964-09-30  1.29   3422.469    5.0
1964-12-31  2.05   3431.957    5.0
1965-03-31  1.28   3516.251    4.9
1965-06-30  2.54   3563.960    4.7
1965-09-30  0.89   3636.285    4.4
1965-12-31  2.90   3724.014    4.1
1966-03-31  4.99   3815.423    3.9
1966-06-30  2.10   3828.124    3.8
...          ...        ...    ...
2002-06-30  1.56  11538.770    5.8
2002-09-30  2.66  11596.430    5.7
2002-12-31  3.08  11598.824    5.8
2003-03-31  1.31  11645.819    5.9
2003-06-30  1.09  11738.706    6.2
2003-09-30  2.60  11935.461    6.1
2003-12-31  3.02  12042.817    5.8
2004-03-31  2.35  12127.623    5.7
2004-06-30  3.61  12213.818    5.6
2004-09-30  3.58  12303.533    5.4
2004-12-31  2.09  12410.282    5.4
2005-03-31  4.15  12534.113    5.3
2005-06-30  1.85  12587.535    5.1
2005-09-30  9.14  12683.153    5.0
2005-12-31  0.40  12748.699    4.9
2006-03-31  2.60  12915.938    4.7
2006-06-30  3.97  12962.462    4.7
2006-09-30 -1.58  12965.916    4.7
2006-12-31  3.30  13060.679    4.4
2007-03-31  4.58  13099.901    4.5
2007-06-30  2.75  13203.977    4.5
2007-09-30  3.45  13321.109    4.7
2007-12-31  6.38  13391.249    4.8
2008-03-31  2.82  13366.865    4.9
2008-06-30  8.53  13415.266    5.4
2008-09-30 -3.16  13324.600    6.0
2008-12-31 -8.79  13141.920    6.9
2009-03-31  0.94  12925.410    8.1
2009-06-30  3.37  12901.504    9.2
2009-09-30  3.56  12990.341    9.6

[203 rows x 3 columns]

In [10]:
pivoted1=ldata.pivot('date','item')
pivoted1[:10]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8 -0.151040  0.776863 -0.654748
1959-06-30  2.34  2778.801   5.1  0.080712  0.519392 -0.955207
1959-09-30  2.74  2775.488   5.3  0.136987 -0.682092  0.573443
1959-12-31  0.27  2785.204   5.6 -1.351917 -0.416602 -0.575776
1960-03-31  2.31  2847.699   5.2  0.449547  0.297183 -1.384694
1960-06-30  0.14  2834.390   5.2  0.525680  1.003489  1.665141
1960-09-30  2.70  2839.022   5.6 -2.333300  0.999837  0.753237
1960-12-31  1.21  2802.616   6.3  0.506202 -0.192515 -1.526198
1961-03-31 -0.40  2819.264   6.8  0.131652  0.767112 -0.250157
1961-06-30  1.47  2872.005   7.0 -2.021614 -0.171699  1.048407

# . melt ( ) :  Wide to long

In [11]:
dff1=pd.DataFrame({'key':['foo','bar','baz'],'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]})
dff1

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [12]:
melt_df=pd.melt(dff1,['key'])
melt_df

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9